src/OneSBuild/src/InformationRegisters/ХранилищеСертификатов/ХранилищеСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХранилищеСертификатов</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипХранилища</name>
    <type>
      <types>EnumRef.ТипХранилищаСертификатов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/OneSBuild/src/InformationRegisters/ХранилищеСертификатов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

#Область ВыгрузитьСертификат

&НаКлиенте
Процедура ВыгрузитьСертификат(Команда)
	
	ТекущаяЗапись = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяЗапись <> Неопределено Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные; // ДанныеФормыСтруктура
		Если ТекущиеДанные <> Неопределено Тогда
			ИмяФайлаСертификата = ТекущиеДанные.Наименование + ".cer";
		Иначе
			ИмяФайлаСертификата = "Сертификат.cer";
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьСертификатПослеВыполненияПоиска", 
			ЭтотОбъект, Новый Структура("ИмяФайла", ИмяФайлаСертификата));
		ХранилищеСертификатовКлиент.НайтиСертификат(Оповещение, Новый Структура("Отпечаток", ТекущиеДанные.Отпечаток));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСертификатПослеВыполненияПоиска(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат.Выполнено И ЗначениеЗаполнено(Результат.Сертификат) Тогда
		ПолучитьФайл(ПоместитьВоВременноеХранилище(Результат.Сертификат.Сертификат), 
			ВходящийКонтекст.ИмяФайла, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузитьСертификат

&НаКлиенте
Процедура ЗагрузитьСертификат(Команда)
	
	ТекстПодсказки = НСтр("ru = 'Укажите тип хранилища'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСертификатПослеВыбораТипаХранилища", ЭтотОбъект);
	ПоказатьВводЗначения(ОписаниеОповещения, , ТекстПодсказки, Тип("ПеречислениеСсылка.ТипХранилищаСертификатов"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатПослеВыбораТипаХранилища(ТипХранилища, ДополнительныеПараметры) Экспорт
	
	Если ТипХранилища <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьСертификатПослеПомещенияФайла", ЭтотОбъект, ТипХранилища);
		НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатПослеПомещенияФайла(Результат, АдресСертификата, ВыбранноеИмяФайла, ТипХранилища) Экспорт
	
	Если Результат Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьСертификатПослеДобавленияВХранилище", ЭтотОбъект);
		ХранилищеСертификатовКлиент.Добавить(Оповещение, АдресСертификата, ТипХранилища);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатПослеДобавленияВХранилище(Результат, ВходящийКонтекст) Экспорт

	Если Результат.Выполнено Тогда
		Элементы.Список.Обновить();
	ИначеЕсли Результат.Свойство("ИнформацияОбОшибке") Тогда 
		ПоказатьПредупреждение(, КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке));		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
